ctapang/v0_70b/framework/peripheral/sqi/processor/sqi_p32mx270f256c.h
/* Created by plibgen $Revision: 1.29 $ */

#ifndef _SQI_P32MX270F256C_H
#define _SQI_P32MX270F256C_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef INLINE_API
    #define INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef INLINE
    #define INLINE extern inline
#endif

typedef enum {

    SQI_NUMBER_OF_MODULES

} SQI_MODULE_ID;

typedef enum {

    SQI_XFER_MODE_NONE

} SQI_XFER_MODE;

typedef enum {

    SQI_DATA_MODE_NONE

} SQI_DATA_MODE;

typedef enum {

    SQI_DATA_FORMAT_NONE

} SQI_DATA_FORMAT;

typedef enum {

    SQI_DATA_OEN_NONE

} SQI_DATA_OEN;

typedef enum {

    SQI_CS_OEN_NONE

} SQI_CS_OEN;

typedef enum {

    SQI_XFER_CMD_NONE

} SQI_XFER_CMD;

typedef enum {

    SQI_LANE_MODE_NONE

} SQI_LANE_MODE;

typedef enum {

    SQI_CS_NUM_NONE

} SQI_CS_NUM;

typedef enum {

    SQI_CLK_DIV_NONE

} SQI_CLK_DIV;

typedef enum {

    SQI_ADDR_BYTES_NONE

} SQI_ADDR_BYTES;

typedef enum {

    SQI_DUMMY_BYTES_NONE

} SQI_DUMMY_BYTES;

typedef enum {

    SQI_MODE_BYTES_NONE

} SQI_MODE_BYTES;

typedef enum {

    SQI_INTERRUPTS_NONE

} SQI_INTERRUPTS;

typedef enum {

    SQI_BD_STATE_NONE

} SQI_BD_STATE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE INLINE

/* Section 3 - PLIB dispatch function definitions */

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPDummyBytesSet(SQI_MODULE_ID index, SQI_DUMMY_BYTES bytes)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_DUMMY_BYTES _PLIB_UNSUPPORTED PLIB_SQI_XIPDummyBytesGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_DUMMY_BYTES)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPNumberOfDummyBytes(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPAddressBytesSet(SQI_MODULE_ID index, SQI_ADDR_BYTES bytes)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_ADDR_BYTES _PLIB_UNSUPPORTED PLIB_SQI_XIPAddressBytesGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_ADDR_BYTES)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPNumberOfAddressBytes(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPReadOpcodeSet(SQI_MODULE_ID index, uint8_t opCode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_XIPReadOpcodeGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPReadOpCode(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPLaneModeSet(SQI_MODULE_ID index, SQI_LANE_MODE dataLanes, SQI_LANE_MODE dummyLanes, SQI_LANE_MODE modeLanes, SQI_LANE_MODE addrLanes, SQI_LANE_MODE cmdLanes)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPLaneMode(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord1Set(SQI_MODULE_ID index, SQI_DUMMY_BYTES dummyBytes, SQI_ADDR_BYTES addressBytes, uint8_t readOpcode, SQI_LANE_MODE dataLaneMode, SQI_LANE_MODE dummyLaneMode, SQI_LANE_MODE modeCodeLaneMode, SQI_LANE_MODE addressLaneMode, SQI_LANE_MODE cmdLaneMode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord1Get(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPControlWord1(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPChipSelectSet(SQI_MODULE_ID index, SQI_CS_NUM csNum)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_CS_NUM _PLIB_UNSUPPORTED PLIB_SQI_XIPChipSelectGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_CS_NUM)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPChipSelect(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPModeBytesSet(SQI_MODULE_ID index, SQI_MODE_BYTES bytes)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_MODE_BYTES _PLIB_UNSUPPORTED PLIB_SQI_XIPModeBytesGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_MODE_BYTES)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPModeBytes(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPModeCodeSet(SQI_MODULE_ID index, uint8_t code)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_XIPModeCodeGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPModeCode(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

