ctapang/v0_70b/framework/peripheral/sqi/processor/sqi_p32mx270f256c.h
INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord2Set(SQI_MODULE_ID index, SQI_CS_NUM devSelect, SQI_MODE_BYTES modeBytes, uint8_t modeCode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_XIPControlWord2Get(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsXIPControlWord2(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_Enable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_Disable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsEnableControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_CSOutputEnableSelect(SQI_MODULE_ID index, SQI_CS_OEN csPins)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsCSOutputEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DataOutputEnableSelect(SQI_MODULE_ID index, SQI_DATA_OEN dataPins)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDataOutputEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_SoftReset(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsSoftReset(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_BurstEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBurstControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_HoldSet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_HoldClear(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_HoldGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsHoldPinControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_WriteProtectSet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_WriteProtectClear(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_WriteProtectGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsWPPinControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ReceiveLatchEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ReceiveLatchDisable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ReceiveLatchGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsReceiveLatch(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DataFormatSet(SQI_MODULE_ID index, SQI_DATA_FORMAT dataformat)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_DATA_FORMAT _PLIB_UNSUPPORTED PLIB_SQI_DataFormatGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_DATA_FORMAT)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDataFormat(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DataModeSet(SQI_MODULE_ID index, SQI_DATA_MODE mode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDataModeControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

